HA_1C/Documents/ВнеплановыеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>ВнеплановыеРаботы</Name>
			<Comment>!</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЗарегистрированныеВР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастерская</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисныеМастерские</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийНомерТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыполненныеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РегламентнаяРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегламентныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееВРСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполненияТО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееВРПериод</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееВРСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееВРИдентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

HA_1C/InformationRegisters/ЗарегистрированныеВР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ЗарегистрированныеВР</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегламентнаяРабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

HA_1C/Documents/ВнеплановыеРаботы/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого ТекСтрока Из ВыполненныеРаботы Цикл

		Движение = Движения.ЗарегистрированныеВР.Добавить();
		Движение.Период = ТекСтрока.ТекущееВРПериод;
		Движение.Автомобиль = Автомобиль;
		Движение.РегламентнаяРабота = ТекСтрока.РегламентнаяРабота;
		Движение.Сумма = ТекСтрока.ТекущееВРСумма;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
